zung::zung! {
    बाहरी टोकरा जंग;

    #[विरासत(Default)]
    संरचना व्यक्ति{
        नाम: डोरी,
        उम्र: पूर्णांक_16,
    }

    कार्यरूप व्यक्ति{
        कार्य नया()-> व्यक्ति{
            व्यक्ति {नाम:"".to_string(), उम्र:0}
        }
    }

    कार्य मुख्य() {

        निरूपित पर्वर्तन्शील पहला = व्यक्ति::नया();

        पंक्तिछाप!("क्रिप्या अपना नाम बताओ");
        मानक::वार्तालाप::stdin().पंक्ति_पढो(&पर्वर्तन्शील पहला.नाम);

        पंक्तिछाप!("क्रिप्या अपनी उम्र बताओ");
        निरूपित पर्वर्तन्शील पंक्ति = डोरी::नयी();
        मानक::वार्तालाप::stdin().पंक्ति_पढो(&पर्वर्तन्शील पंक्ति).आपेक्षा("पंक्ति नहि पढी जा सकि ");

        मेल  पंक्ति.trim().parse::<पूर्णांक_16>(){
            थीक(उम्र) => पहला.उम्र = उम्र,
            समस्या(_) =>पंक्तिछाप!("क्रिपया केवल एक पूणांक डलो"),
        };
        पंक्तिछाप!("{:?}, {:?}, आपका जंग कोड में स्वागत है!",पहला.नाम,पहला.उम्र );

    }

}
